---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.RebarSystemTopMajorMatchesBottomMajor
source: html/21a9b7a7-3e38-fc39-e614-e8969ef9040c.htm
---
# Autodesk.Revit.DB.ParameterTypeId.RebarSystemTopMajorMatchesBottomMajor Property

"Top and Bottom Major Layers Match"

## Syntax (C#)
```csharp
public static ForgeTypeId RebarSystemTopMajorMatchesBottomMajor { get; }
```